<?php if ( ! defined('BASEPATH')) exit('No direct script access allowed');

class Language_lib {

	var $normalizeChars = "";

	public function __construct()
	{
			
		$this->normalizeChars = array(
			'Š'=>'S', 'š'=>'s', 'Ð'=>'Dj','Ž'=>'Z', 'ž'=>'z', 'À'=>'A', 'Á'=>'A', 'Â'=>'A', 'Ã'=>'A', 'Ä'=>'A',
			'Å'=>'A', 'Æ'=>'A', 'Ç'=>'C', 'È'=>'E', 'É'=>'E', 'Ê'=>'E', 'Ë'=>'E', 'Ì'=>'I', 'Í'=>'I', 'Î'=>'I',
			'Ï'=>'I', 'Ñ'=>'N', 'Ń'=>'N', 'Ò'=>'O', 'Ó'=>'O', 'Ô'=>'O', 'Õ'=>'O', 'Ö'=>'O', 'Ø'=>'O', 'Ù'=>'U', 'Ú'=>'U',
			'Û'=>'U', 'Ü'=>'U', 'Ý'=>'Y', 'Þ'=>'B', 'ß'=>'Ss','à'=>'a', 'á'=>'a', 'â'=>'a', 'ã'=>'a', 'ä'=>'a',
			'å'=>'a', 'æ'=>'a', 'ç'=>'c', 'è'=>'e', 'é'=>'e', 'ê'=>'e', 'ë'=>'e', 'ì'=>'i', 'í'=>'i', 'î'=>'i',
			'ï'=>'i', 'ð'=>'o', 'ñ'=>'n', 'ń'=>'n', 'ò'=>'o', 'ó'=>'o', 'ô'=>'o', 'õ'=>'o', 'ö'=>'o', 'ø'=>'o', 'ù'=>'u',
			'ú'=>'u', 'û'=>'u', 'ü'=>'u', 'ý'=>'y', 'ý'=>'y', 'þ'=>'b', 'ÿ'=>'y', 'ƒ'=>'f',
			'ă'=>'a', 'î'=>'i', 'â'=>'a', 'ș'=>'s', 'ț'=>'t', 'Ă'=>'A', 'Î'=>'I', 'Â'=>'A', 'Ș'=>'S', 'Ț'=>'T',
		);	
		
		$this->normalizeRussianChars = array(
			'А'=>'A', 'Б'=>'B', 'В'=>'V','Г'=>'G', 'Д'=>'D', 'Е'=>'Y', 'Ё'=>'YO', 'Ж'=>'J', 'З'=>'Z', 'И'=>'I', 'Й'=>'IY', 
			'К'=>'K', 'Л'=>'L', 'М'=>'M', 'Н'=>'N', 'О'=>'O', 'П'=>'P', 'Р'=>'R', 'С'=>'S', 'Т'=>'T', 'У'=>'U', 'Ф'=>'F', 
			'Х'=>'H', 'Ц'=>'TSE', 'Ч'=>'C', 'Ш'=>'SH', 
			'Щ'=>'SEE', 'Ъ'=>'AY', 'Ы'=>'I', 'Ь'=>'OY', 'Э'=>'E', 'Ю'=>'YU', 'Я'=>'YA',
			
		);
		
		
	}

	
	
	public function get_normal_string($accent_string)
	{
		
		$norm_string = strtr($accent_string, $this->normalizeChars);
		return $norm_string;
	}
		
	
	
	
}

/* End of file Myhelpers.php */